renesas/rx-driver-package/source/r_qspix_rx/r_qspix_rx_vx.xx/r_qspix_rx/src/targets/rx671/r_qspix_rx671.c
/*******************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only
* intended for use with Renesas products. No other uses are authorized. This
* software is owned by Renesas Electronics Corporation and is protected under
* all applicable laws, including copyright laws.
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT
* LIMITED TO WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE
* AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED.
* TO THE MAXIMUM EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS
* ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES SHALL BE LIABLE
* FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR
* ANY REASON RELATED TO THIS SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE
* BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software
* and to discontinue the availability of this software. By using this software,
* you agree to the additional terms and conditions found by accessing the
* following link:
* http://www.renesas.com/disclaimer
*
* Copyright (C) 2021 Renesas Electronics Corporation. All rights reserved.
*******************************************************************************/
/*******************************************************************************
* History      : DD.MM.YYYY Version  Description
*              : 31.03.2021 1.00     First Release
*              : 20.09.2021 1.10     Fixed r_qspix_write_indirect()
*              : 29.11.2021 1.20     Supported to call R_QSPIX_Write_Indirect() 
*                                    multiple times
*              : 16.03.2023 1.40     Added r_qspix_read_memory_map() function
*              : 13.12.2023 1.41     Added WAIT_LOOP comments.
*******************************************************************************/
/*******************************************************************************
* File Name    : r_qspix_rx671.c
* Description  : Functions for using QSPIX on RX devices.
*******************************************************************************/
/* Access to peripherals and board defines. */
#include "platform.h"

#ifdef BSP_MCU_RX671

/*****************************************************************************
Includes   <System Includes> , "Project Includes"
******************************************************************************/
/* Defines for QSPIX support */
#include "r_qspix_rx_private.h"
#include "r_qspix_rx671_private.h"
#include "r_qspix_rx_if.h"
#include "r_qspix_rx_config.h"

/*******************************************************************************
Private global variables and functions
*******************************************************************************/
qspix_hdl_t g_qspix_handles[QSPIX_NUM_CH];

#if QSPIX_CFG_ERI_INCLUDED
static void r_qspix_eri_grp_isr(void *pdata);
#endif

/*----------------------------------------------------------------------------*/
/*  internal functions                                                        */
/*----------------------------------------------------------------------------*/

/************************************************************************************
* Function Name: r_qspix_parameter_channel_check
* Description  : Checks channel parameter.
* Arguments    : channel
* Return Value : QSPIX_SUCCESS              Successful operation
*              ; QSPIX_ERR_INVALID_ARG      Parameter error
************************************************************************************/
qspix_err_t r_qspix_parameter_channel_check(uint8_t channel)
{
    qspix_err_t ret = QSPIX_SUCCESS;

    /* ---- Check channel argument. ---- */
        if (QSPIX_CH0 != channel)
        {
            return QSPIX_ERR_INVALID_ARG;
        }
    return ret;
}
/******************************************************************************
End of function r_qspix_parameter_channel_check
******************************************************************************/

/************************************************************************************
* Function Name: r_qspix_parameter_check
* Description  : Checks parameter.
* Arguments    : channel
*                p_cfg
* Return Value : QSPIX_SUCCESS              Processing completed without problem
*              : QSPIX_ERR_INVALID_ARG      Invalid argument
*              ; QSPIX_ERR_NULL_PTR         Argument pointers are NULL
************************************************************************************/
qspix_err_t r_qspix_parameter_check(uint8_t channel, qspix_cfg_t * p_cfg)
{
    qspix_err_t ret = QSPIX_SUCCESS;

    /* ---- Check channel argument. ---- */
    ret = r_qspix_parameter_channel_check(channel);

    if(QSPIX_SUCCESS != ret)
    {
        return ret;
    }

    /* ---- Check p_cfg argument. ---- */
    if(NULL == p_cfg)
    {
        return QSPIX_ERR_NULL_PTR;
    }
    
#if QSPIX_CFG_ERI_INCLUDED
    /* Call the user callback function passing pointer to the result structure. */
    if ((FIT_NO_FUNC == p_cfg->p_callback) || (NULL == p_cfg->p_callback))
    {
        return QSPIX_ERR_INVALID_ARG;
    }
#endif   

    /* ---- Check address_size of p_cfg argument. ---- */
    if (QSPIX_4_BYTES != p_cfg->address_size)
    {
        if (QSPIX_INSTRUCTION_4_BYTE_ADDRESS_ENABLE ==
                                            p_cfg->instruction_4_Byte_address)
        {
            return QSPIX_ERR_INVALID_ARG;
        }
    }

    /* ---- Check data_output_select of p_cfg argument. ---- */
    if (QSPIX_EXTEND_BY_1_QSPCLK == p_cfg->data_output_select)
    {
        if (QSPIX_3_QSPCLK == p_cfg->dummy_clocks)
        {
            return QSPIX_ERR_INVALID_ARG;
        }
    }

    return ret;
}
/******************************************************************************
End of function r_qspix_parameter_check
******************************************************************************/

/************************************************************************************
* Function Name: r_qspix_enable
* Description  : Enable QSPIX.
* Arguments    : channel
*                p_cfg
* Return Value : QSPIX_SUCCESS              Processing completed without problem
*              : QSPIX_ERR_OPENED           QSPIX was initialized already
*              : QSPIX_ERR_INVALID_ARG      Invalid argument
*              : QSPIX_ERR_NULL_PTR         Argument pointers are NULL
*              : QSPIX_ERR_BUSY             The QSPIX resources are locked by another process
************************************************************************************/
qspix_err_t r_qspix_enable(uint8_t channel, qspix_cfg_t * p_cfg)
{
    qspix_err_t ret = QSPIX_SUCCESS;
    
#if QSPIX_CFG_ERI_INCLUDED
    bsp_int_ctrl_t int_ctrl_data;

    /* Set interrupt priority */
    int_ctrl_data.ipl = (uint32_t)QSPIX_CFG_ERI_IR_PRIORITY;
#endif

