renesas/rx-driver-package/source/r_qspix_rx/r_qspix_rx_vx.xx/r_qspix_rx/src/targets/rx671/r_qspix_rx671.c
#if QSPIX_CFG_PARAM_CHECKING_ENABLE
    if(QSPIX_OPEN == g_qspix_handles[channel].open)
    {
        return QSPIX_ERR_OPENED;
    }
#endif
    /* Check hw lock require */
    if (false == R_BSP_HardwareLock((mcu_lock_t)(BSP_LOCK_QSPIX)))
    {
        /* Lock has already been acquired by another task. Need to try again later. */
      return QSPIX_ERR_BUSY;
    }

#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
bsp_int_ctrl_t int_ctrl;
#endif
    /* Enable writing to MSTP registers. */
    R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);

#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
#endif
    /* Release from module stop state. */
    MSTP(QSPIX) = 0;

#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
#endif

    /* Disable writing to MSTP registers. */
    R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);

#if QSPIX_CFG_ERI_INCLUDED
    /* Enable the group interrupt for the AL0 interrupt. (sets priority also). */
    R_BSP_InterruptControl(BSP_INT_SRC_AL0_QSPIX_ERI, BSP_INT_CMD_GROUP_INTERRUPT_ENABLE, &int_ctrl_data);

    /* Register the error callback function with the BSP group interrupt handler. */
    R_BSP_InterruptWrite(BSP_INT_SRC_AL0_QSPIX_ERI, (bsp_int_cb_t)r_qspix_eri_grp_isr);

    #if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
    #endif

    /* Enable error interrupt source bit */
    ICU.GENAL0.BIT.EN30 = 1;

    #if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
    #endif

    /* Dummy read */
    if (0 == ICU.GENAL0.BIT.EN30)
    {
        R_BSP_NOP();
    }
#endif

    /* Set for I/O Mode Select */
    QSPIX.SPMR2.BIT.IOMOD = p_cfg->protocol;

    /* Set for Slave Select Extension */
    QSPIX.SPMR0.BIT.SSE = p_cfg->slave_select_extension;

    /* Set for Prefetch Function Enable */
    QSPIX.SPMR0.BIT.PFE = p_cfg->prefetch_function;

    /* Set for Clock Mode Select */
    QSPIX.SPMR0.BIT.CKMD = p_cfg->clock_mode;

    /* Set for Data Output Duration Extension */
    QSPIX.SPMR0.BIT.DODE = p_cfg->data_output_select;

    /* Set for Special Read Instruction Select */
    QSPIX.SPMR0.BIT.SRIS = p_cfg->special_instruction_select;

    /* Set for Special Read Instruction Setting Register */
    if (QSPIX_INSTRUCTION_CODE_IN_SPRIR_REGISTER ==
                                            p_cfg->special_instruction_select)
    {
        /* Set for Special Read Instruction Setting Register */
        QSPIX.SPRIR = p_cfg->qspix_special_read_instruction;
    }
    else
    {
        /* Set for Read Instruction Select */
        QSPIX.SPMR0.BIT.RISEL = p_cfg->read_mode;
    }

    /* Set for Slave Select High Width Setting */
    QSPIX.SPSSCR.BIT.SSHW = p_cfg->slave_select_high_width;

    /* Set for Slave Select Hold Time Setting */
    QSPIX.SPSSCR.BIT.SSHLD = p_cfg->slave_select_hold_time;

    /* Set for Slave Select Setup Time Setting */
    QSPIX.SPSSCR.BIT.SSSU = p_cfg->slave_select_setup_time;

    /* Set for Clock Divisor Select */
    QSPIX.SPOCR.BIT.DIV = p_cfg->clock_divisor;

    /* Set for combination of Duty with Clock divisor  */
    if(((uint8_t)(p_cfg->clock_divisor & 0x01)) && (p_cfg->clock_divisor < QSPIX_ICLK_DIV_18))
    {
        /* Set for Duty Cycle Correction when the divisor is odd number */
        QSPIX.SPOCR.BIT.DUTY  = QSPIX_CORRECT_THE_DUTY_CYCLE;
    }
    else
    {
        /* Disable Duty Cycle Correction when the divisor is even number */
        QSPIX.SPOCR.BIT.DUTY  = QSPIX_MAKE_NO_CORRECTION;
    }

    /* Set for Memory mode */
    QSPIX.SPMR1.BIT.AMOD = QSPIX_MEMORY_MAPPED_MODE;

    /* Set for Address Size Setting */
    QSPIX.SPAMR.BIT.SIZE = p_cfg->address_size;

    /* Check combination for Address Size vs Instruction with 4-Byte Address enable*/
    if (QSPIX_4_BYTES == p_cfg->address_size)
    {
        /* Set for Instruction with 4-Byte Address Enable */
        QSPIX.SPAMR.BIT.I4AE = p_cfg->instruction_4_Byte_address;
    }

    /* Set for Number of Dummy Cycle */
    QSPIX.SPDCR.BIT.DCYC = p_cfg->dummy_clocks;


    /* Set for WP Pin Control */
    QSPIX.SPPCR.BIT.WP = p_cfg->WP_pin_control;

    /* Store to global variable */
   g_qspix_handles[channel].open = QSPIX_OPEN;
   g_qspix_handles[channel].p_cfg = *p_cfg;

    return ret;
}
/******************************************************************************
End of function r_qspix_enable
******************************************************************************/

/************************************************************************************
* Function Name: r_qspix_disable
* Description  : Enable QSPIX.
* Arguments    : channel
*                p_cfg
* Return Value : QSPIX_SUCCESS              Processing completed without problem
*              : QSPIX_ERR_NOT_OPEN         QSPIX module is not initialized yet
*              : QSPIX_ERR_INVALID_ARG      Invalid argument
************************************************************************************/
qspix_err_t r_qspix_disable(uint8_t channel)
{
    qspix_err_t ret = QSPIX_SUCCESS;
    qspix_cfg_t p_cfg;
#if QSPIX_CFG_PARAM_CHECKING_ENABLE
    if(QSPIX_CLOSE == g_qspix_handles[channel].open)
    {
        return QSPIX_ERR_NOT_OPEN;
    }

#endif
    /* Unlock hw */
    R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_QSPIX));

#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
bsp_int_ctrl_t int_ctrl;
#endif
    /* Enable writing to MSTP registers. */
    R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);

#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
#endif
    /* Set to module stop state. */
    MSTP(QSPIX) = 1;

#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
#endif
    /* Disable writing to MSTP registers. */
    R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);

    /* De-register the error callback function with the BSP group interrupt handler. */
    R_BSP_InterruptWrite(BSP_INT_SRC_AL0_QSPIX_ERI, FIT_NO_FUNC);

#if QSPIX_CFG_ERI_INCLUDED
    /* Disable error interrupt source bit */
    #if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
    #endif

