renesas/rx-driver-package/source/r_qspix_rx/r_qspix_rx_vx.xx/r_qspix_rx/src/targets/rx671/r_qspix_rx671.c
    /* Disable error interrupt source bit */
    ICU.GENAL0.BIT.EN30 = 0;

    #if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
    #endif

    /* Dummy read */
    if (0 == ICU.GENAL0.BIT.EN30)
    {
        R_BSP_NOP();
    }
#endif
    g_qspix_handles[channel].open = QSPIX_CLOSE;
    
    /* Reset value read_mode */
    p_cfg.read_mode = QSPIX_READ_MODE_STANDARD;
    
    /* Reset value slave_select_extension */
    p_cfg.slave_select_extension = QSPIX_DO_NOT_EXTEND_QSSL;
    
    /* Reset value prefetch_function */
    p_cfg.prefetch_function = QSPIX_PREFETCH_DISABLE;
    
    /* Reset value clock_mode */
    p_cfg.clock_mode = QSPIX_SPI_MODE_0;
    
    /* Reset value data_output_select */
    p_cfg.data_output_select = QSPIX_DO_NOT_EXTEND;
    
    /* Reset value special_instruction_select */
    p_cfg.special_instruction_select = QSPIX_DEFAULT_INSTRUCTION_CODE;
    
    /* Reset value slave_select_high_width */
    p_cfg.slave_select_high_width = QSPIX_1_CYCLE_QSPCLK;
    
    /* Reset value slave_select_hold_time */
    p_cfg.slave_select_hold_time = QSPIX_RELEASE_QSSL_0_5_QSPCLK;
    
    /* Reset value slave_select_setup_time */
    p_cfg.slave_select_setup_time = QSPIX_OUTPUT_QSSL_0_5_QSPCLK;
    
    /* Reset value clock_divisor */
    p_cfg.clock_divisor = QSPIX_ICLK_DIV_2;
    
    /* Reset value address_size */
    p_cfg.address_size = QSPIX_1_BYTE;
    
    /* Reset value instruction_4_Byte_address */
    p_cfg.instruction_4_Byte_address = QSPIX_INSTRUCTION_4_BYTE_ADDRESS_DISABLE;
    
    /* Reset value dummy_clocks */
    p_cfg.dummy_clocks = QSPIX_DEFAULT_DUMMY_CYCLES;
    
    /* Reset value protocol */
    p_cfg.protocol = QSPIX_EXTENDED_SPI_PROTOCOL;
    
    /* Reset value WP_pin_control */
    p_cfg.WP_pin_control = QSPIX_LOW_LEVEL;
    
    /* Reset value p_callback */
    p_cfg.p_callback = 0;
    
    /* Reset value p_cfg */
    g_qspix_handles[channel].p_cfg = p_cfg;

    return ret;
}
/******************************************************************************
End of function r_qspix_disable
******************************************************************************/

/************************************************************************************
* Function Name: r_qspix_control
* Description  : Control QSPIX.
* Arguments    : channel
*                p_cfg
* Return Value : QSPIX_SUCCESS              Processing completed without problem
*              : QSPIX_ERR_NOT_OPEN         QSPIX module is not initialized yet
*              : QSPIX_ERR_INVALID_ARG      Invalid argument
*              : QSPIX_ERR_NULL_PTR         Argument pointers are NULL
*              : QSPIX_ERR_BUSY             The QSPIX resources are locked by another process
************************************************************************************/
qspix_err_t r_qspix_control(uint8_t channel, qspix_cfg_t * p_cfg)
{
    qspix_err_t ret = QSPIX_SUCCESS;

#if QSPIX_CFG_PARAM_CHECKING_ENABLE
    if(QSPIX_CLOSE == g_qspix_handles[channel].open)
    {
        return QSPIX_ERR_NOT_OPEN;
    }
#endif
    /* Set for I/O Mode Select */
    QSPIX.SPMR2.BIT.IOMOD = p_cfg->protocol;

    /* Set for Slave Select Extension */
    QSPIX.SPMR0.BIT.SSE = p_cfg->slave_select_extension;

    /* Set for Prefetch Function Enable */
    QSPIX.SPMR0.BIT.PFE = p_cfg->prefetch_function;

    /* Set for Clock Mode Select */
    QSPIX.SPMR0.BIT.CKMD = p_cfg->clock_mode;

    /* Set for Data Output Duration Extension */
    QSPIX.SPMR0.BIT.DODE = p_cfg->data_output_select;

    /* Set for Special Read Instruction Select */
    QSPIX.SPMR0.BIT.SRIS = p_cfg->special_instruction_select;

    /* Set for Special Read Instruction Setting Register */
    if (QSPIX_INSTRUCTION_CODE_IN_SPRIR_REGISTER ==
                                            p_cfg->special_instruction_select)
    {
        /* Set for Special Read Instruction Setting Register */
        QSPIX.SPRIR = p_cfg->qspix_special_read_instruction;
    }
    else
    {
        /* Set for Read Instruction Select */
        QSPIX.SPMR0.BIT.RISEL = p_cfg->read_mode;
    }

    /* Set for Slave Select High Width Setting */
    QSPIX.SPSSCR.BIT.SSHW = p_cfg->slave_select_high_width;

    /* Set for Slave Select Hold Time Setting */
    QSPIX.SPSSCR.BIT.SSHLD = p_cfg->slave_select_hold_time;

    /* Set for Slave Select Setup Time Setting */
    QSPIX.SPSSCR.BIT.SSSU = p_cfg->slave_select_setup_time;

    /* Set for Clock Divisor Select */
    QSPIX.SPOCR.BIT.DIV = p_cfg->clock_divisor;

    /* Set for combination of Duty with Clock divisor  */
    if(((uint8_t)(p_cfg->clock_divisor & 0x01)) && (p_cfg->clock_divisor < QSPIX_ICLK_DIV_18))
    {
        /* Set for Duty Cycle Correction when the divisor is odd number */
        QSPIX.SPOCR.BIT.DUTY  = QSPIX_CORRECT_THE_DUTY_CYCLE;
    }
    else
    {
        /* Disable Duty Cycle Correction when the divisor is even number */
        QSPIX.SPOCR.BIT.DUTY  = QSPIX_MAKE_NO_CORRECTION;
    }

    /* Set for Memory mode */
    QSPIX.SPMR1.BIT.AMOD = QSPIX_MEMORY_MAPPED_MODE;

    /* Set for Address Size Setting */
    QSPIX.SPAMR.BIT.SIZE = p_cfg->address_size;

    /* Check combination for Address Size vs Instruction with 4-Byte Address
Enable*/
    if (QSPIX_4_BYTES == p_cfg->address_size)
    {
        /* Set for Instruction with 4-Byte Address Enable */
        QSPIX.SPAMR.BIT.I4AE = p_cfg->instruction_4_Byte_address;
    }

    /* Set for Number of Dummy Cycle */
    QSPIX.SPDCR.BIT.DCYC = p_cfg->dummy_clocks;

    /* Set for WP Pin Control */
    QSPIX.SPPCR.BIT.WP = p_cfg->WP_pin_control;

    g_qspix_handles[channel].p_cfg = *p_cfg;

    return ret;
}
/******************************************************************************
End of function r_qspix_control
******************************************************************************/

/************************************************************************************
* Function Name: r_qspix_xip
* Description  : Enter or exit XIP mode QSPIX.
* Arguments    : channel
*                mode
*                action
* Return Value : QSPIX_SUCCESS              Processing completed without problem
*              : QSPIX_ERR_HW               HW error
************************************************************************************/
qspix_err_t r_qspix_xip(uint8_t channel, uint8_t mode, bool action)
{
    qspix_err_t ret = QSPIX_SUCCESS;
    volatile uint8_t uc_temp = 0;
#if QSPIX_CFG_PARAM_CHECKING_ENABLE
    ret = r_qspix_parameter_channel_check(channel);
    if(QSPIX_SUCCESS != ret)
    {
        return ret;
    }

    if(QSPIX_CLOSE == g_qspix_handles[channel].open)
    {
        return QSPIX_ERR_NOT_OPEN;
    }
#endif
    if(action)
    {
        /* Set mode for XIP */
        QSPIX.SPDCR.BIT.MODE = mode;

        /* Enter to XIP */
        QSPIX.SPDCR.BIT.XIPE = QSPIX_XIP_ENABLE;

