renesas/rx-driver-package/source/r_qspix_rx/r_qspix_rx_vx.xx/r_qspix_rx/src/targets/rx671/r_qspix_rx671.c
        /*Read data from memory map to trigger XIP mode.*/
        uc_temp = *(volatile uint8_t *)QSPI_DEVICE_START_ADDRESS;

        /* Read 1 from the XIPS bit in the SPDCR register */
        if(QSPIX_XIP_ENABLE != QSPIX.SPDCR.BIT.XIPS)
        {
            ret = QSPIX_ERR_HW;
        }
    }
    else
    {
        /* Set mode for XIP */
        QSPIX.SPDCR.BIT.MODE = mode;

        /* Exit to XIP */
        QSPIX.SPDCR.BIT.XIPE = QSPIX_XIP_DISABLE;

        /*Read data from memory map to trigger XIP mode.*/
        uc_temp = *(volatile uint8_t *)QSPI_DEVICE_START_ADDRESS;

        /* Read 0 from the XIPS bit in the SPDCR register */
        if(QSPIX_XIP_DISABLE != QSPIX.SPDCR.BIT.XIPS)
        {
            ret = QSPIX_ERR_HW;
        }
    }
    return ret;
}
/******************************************************************************
End of function r_qspix_xip
******************************************************************************/

/************************************************************************************
* Function Name: r_qspix_get_status
* Description  : Get status.
* Arguments    : cmd
*                return_status
* Return Value : QSPIX_SUCCESS              Processing completed without problem
*              : QSPIX_ERR_INVALID_COMMAND  Command parameters are invalid.
************************************************************************************/
qspix_err_t r_qspix_get_status(qspix_cmd_t cmd, uint8_t *return_status)
{
    qspix_err_t ret = QSPIX_SUCCESS;
#if QSPIX_CFG_PARAM_CHECKING_ENABLE
if (NULL == return_status)
    {
        return QSPIX_ERR_NULL_PTR;
    }
#endif
    /* ---- Check channel argument. ---- */
    switch(cmd)
    {
        case QSPIX_GET_PREFETCH_BUFFER_FILL_LEVEL:

            /* Return prefetch buffer fill level */
            *return_status = (uint8_t)QSPIX.SPPFSR.BIT.PBLVL;
            break;

        case QSPIX_GET_PREFETCH_BUFFER_FULL_FLAG:

        /* Return prefetch buffer full flag */
            *return_status = (uint8_t)QSPIX.SPPFSR.BIT.PBFUL;
            break;

        case QSPIX_GET_PREFETCH_FUNCTION_OPERATING_STATUS_FLAG:

        /* Return prefetch operating status flag */
            *return_status = (uint8_t)QSPIX.SPPFSR.BIT.PFOSF;
            break;

        case QSPIX_GET_BUS_BUSY_FLAG:

        /* Return bus busy flag */
            *return_status = (uint8_t)QSPIX.SPSR.BIT.BUSY;
            break;

        case QSPIX_GET_ROM_ACCESS_ERROR_FLAG:

        /* Return ROM access error flag */
            *return_status = (uint8_t)QSPIX.SPSR.BIT.ROMAE;
            break;

        case QSPIX_GET_XIP_STATUS_FLAG:

        /* Return XIP status flag */
            *return_status = (uint8_t)QSPIX.SPDCR.BIT.XIPS;
            break;
        default:

        /* Invalid command */
            ret = QSPIX_ERR_INVALID_COMMAND;
            break;

    }
    return ret;
}
/******************************************************************************
End of function r_qspix_get_status
******************************************************************************/

/************************************************************************************
* Function Name: r_qspix_read_indirect
* Description  : Read raw data.
* Arguments    : channel
*                p_des_addr
*                bytes
* Return Value : QSPIX_SUCCESS              Processing completed without problem
*              : QSPIX_ERR_NOT_OPEN         QSPIX module is not initialized yet
*              : QSPIX_ERR_INVALID_ARG      Invalid argument
*              : QSPIX_ERR_NULL_PTR         Argument pointers are NULL
************************************************************************************/
qspix_err_t r_qspix_read_indirect(uint8_t channel,
                                  uint8_t *p_des_addr,
                                  uint32_t bytes)
{
    qspix_err_t ret = QSPIX_SUCCESS;

#if QSPIX_CFG_PARAM_CHECKING_ENABLE
    ret = r_qspix_parameter_channel_check(channel);
    if(QSPIX_SUCCESS != ret)
    {
        return ret;
    }
    if(NULL == p_des_addr)
    {
       return QSPIX_ERR_NULL_PTR;
    }

    if(QSPIX_CLOSE == g_qspix_handles[channel].open)
    {
        return QSPIX_ERR_NOT_OPEN;
    }
#endif
    /* Read data from QSPI. */
    /* WAIT_LOOP */
    for (uint32_t i = 0; i < bytes; i++)
    {
        /* Store data to p_des_addr */
        p_des_addr[i] = (uint8_t) QSPIX.SPDR;
    }

    /* Close bus cycle process */
    QSPIX.SPMR1.BIT.AMOD = QSPIX_INDIRECT_ACCESS_MODE;

    /* Close bus cycle process */
    QSPIX.SPMR1.BIT.AMOD = QSPIX_MEMORY_MAPPED_MODE;

    /* Set protocol */
    QSPIX.SPMR2.BIT.IOMOD = g_qspix_handles[channel].p_cfg.protocol;
    return ret;
}
/******************************************************************************
End of function r_qspix_read_indirect
******************************************************************************/

/************************************************************************************
* Function Name: r_qspix_read_memory_map
* Description  : Read raw data.
* Arguments    : channel
*                p_des_addr
*                p_addr
*                protocol_ext
*                addr_size
*                bytes
* Return Value : QSPIX_SUCCESS              Processing completed without problem
*              : QSPIX_ERR_NOT_OPEN         QSPIX module is not initialized yet
*              : QSPIX_ERR_INVALID_ARG      Invalid argument
*              : QSPIX_ERR_NULL_PTR         Argument pointers are NULL
************************************************************************************/
qspix_err_t r_qspix_read_memory_map(uint8_t channel,
                                  uint8_t *p_des_addr,
                                  uint32_t p_addr,
                                  qspix_protocol_t protocol_ext,
                                  qspix_address_size_t addr_size,
                                  uint32_t bytes)
{
    qspix_err_t ret = QSPIX_SUCCESS;
    volatile uint8_t *rom_addr = (volatile uint8_t*)(QSPI_DEVICE_START_ADDRESS + p_addr);

