renesas/rx-driver-package/source/r_qspix_rx/r_qspix_rx_vx.xx/r_qspix_rx/src/targets/rx671/r_qspix_rx671.c
#if QSPIX_CFG_PARAM_CHECKING_ENABLE
    ret = r_qspix_parameter_channel_check(channel);

    if(QSPIX_SUCCESS != ret)
    {
        return ret;
    }

    if(NULL == p_des_addr)
    {
       return QSPIX_ERR_NULL_PTR;
    }

    if(QSPIX_CLOSE == g_qspix_handles[channel].open)
    {
        return QSPIX_ERR_NOT_OPEN;
    }

    if((QSPIX_1_BYTE != addr_size) && (QSPIX_2_BYTES != addr_size) && \
       (QSPIX_3_BYTES != addr_size) && (QSPIX_4_BYTES != addr_size))
    {
        return QSPIX_ERR_INVALID_ARG;
    }

    if(((uint32_t)QSPI_DEVICE_OFFSET_ADDRESS <= p_addr) || (bytes > ((uint32_t)QSPI_DEVICE_END_ADDRESS - (p_addr + (uint32_t)QSPI_DEVICE_START_ADDRESS))))
    {
        return QSPIX_ERR_INVALID_ARG;
    }
#endif

    /* Check current access mode */
    if (QSPIX_MEMORY_MAPPED_MODE != QSPIX.SPMR1.BIT.AMOD)
    {
        return QSPIX_ERR_INVALID_ARG;
    }

    /* Check Prefetch function enable*/
    if (QSPIX_PREFETCH_ENABLE != QSPIX.SPMR0.BIT.PFE)
    {
        QSPIX.SPMR0.BIT.PFE = QSPIX_PREFETCH_ENABLE;
    }

    /* Update address size */
    QSPIX.SPAMR.BIT.SIZE = addr_size;

    /* Select Read Instruction. */
    switch(protocol_ext)
    {
        case QSPIX_EXTENDED_SPI_PROTOCOL:
        {
            QSPIX.SPMR0.BIT.RISEL = QSPIX_READ_MODE_FAST_READ;
        }
        break;
        case QSPIX_DUAL_SPI_PROTOCOL:
        {
            QSPIX.SPMR0.BIT.RISEL = QSPIX_READ_MODE_FAST_READ_DUAL_OUTPUT;
        }
        break;
        case QSPIX_QUAD_SPI_PROTOCOL:
        {
            QSPIX.SPMR0.BIT.RISEL = QSPIX_READ_MODE_FAST_READ_QUAD_OUTPUT;
        }
        break;
        default:
            /* Do nothing. */
        break;
    }

    /* Wait for bit release */
    if(0 == QSPIX.SPMR0.BIT.RISEL)
    {
        R_BSP_NOP();
    }

    /* Make the TAG valid to start prefetch */
    *rom_addr = 0;

    /* Read access to QSPI memory space */
    /* WAIT_LOOP */
    for (uint32_t i = 0; i < bytes; i++)
    {
        /* Wait for 1-byte data to be received */
        /* WAIT_LOOP */
        while((QSPIX.SPPFSR.BIT.PBLVL & 0x1F) < 0x01);

        /* Store data to p_des_addr */
        p_des_addr[i] = *(rom_addr++);
    }

    /* Disable Prefetch function */
    QSPIX.SPMR0.BIT.PFE = QSPIX_PREFETCH_DISABLE;

    return ret;
}
/******************************************************************************
End of function r_qspix_read_memory_map
******************************************************************************/

/************************************************************************************
* Function Name: r_qspix_write_indirect
* Description  : Write raw data.
* Arguments    : channel
*                p_src_addr
*                bytes
*                read_after_write
* Return Value : QSPIX_SUCCESS              Processing completed without problem
*              : QSPIX_ERR_NOT_OPEN         QSPIX module is not initialized yet
*              : QSPIX_ERR_INVALID_ARG      Invalid argument
*              : QSPIX_ERR_NULL_PTR         Argument pointers are NULL
************************************************************************************/
qspix_err_t r_qspix_write_indirect(uint8_t channel,
                                   uint8_t *p_src_addr,
                                   uint32_t bytes,
                                   bool read_after_write)
{
    qspix_err_t ret = QSPIX_SUCCESS;

#if QSPIX_CFG_PARAM_CHECKING_ENABLE
    ret = r_qspix_parameter_channel_check(channel);
    if(QSPIX_SUCCESS != ret)
    {
        return ret;
    }
    if(NULL == p_src_addr)
    {
       return QSPIX_ERR_NULL_PTR;
    }
    if(QSPIX_CLOSE == g_qspix_handles[channel].open)
    {
        return QSPIX_ERR_NOT_OPEN;
    }
#endif

    /* Check current access mode */
    if (QSPIX_INDIRECT_ACCESS_MODE != QSPIX.SPMR1.BIT.AMOD)
    {
        /* Switch to indirect access mode */
        QSPIX.SPMR2.BIT.IOMOD = QSPIX_EXTENDED_SPI_PROTOCOL;

        /* Open bus cycle process */
        QSPIX.SPMR1.BIT.AMOD = QSPIX_INDIRECT_ACCESS_MODE;
    }

    /* Write data to QSPI. */
    /* WAIT_LOOP */
    for (uint32_t i = 0; i < bytes; i++)
    {
        /* write data from p_src_addr to spi bus */
        QSPIX.SPDR = p_src_addr[i];
    }

    if (!read_after_write)
    {

        /* Close bus cycle process */
        QSPIX.SPMR1.BIT.AMOD = QSPIX_INDIRECT_ACCESS_MODE;

        /* Close bus cycle process */
        QSPIX.SPMR1.BIT.AMOD = QSPIX_MEMORY_MAPPED_MODE;
        
        /* Set protocol */
        QSPIX.SPMR2.BIT.IOMOD = g_qspix_handles[channel].p_cfg.protocol;
    }
    return ret;
}
/******************************************************************************
End of function r_qspix_write_indirect
******************************************************************************/

/************************************************************************************
* Function Name: r_qspix_set_spi_protocol
* Description  : Set SPI protocol.
* Arguments    : channel
*                protocol
* Return Value : QSPIX_SUCCESS              Processing completed without problem
*              : QSPIX_ERR_NOT_OPEN         QSPIX module is not initialized yet
*              : QSPIX_ERR_INVALID_ARG      Invalid argument
************************************************************************************/
qspix_err_t r_qspix_set_spi_protocol(uint8_t channel, qspix_protocol_t protocol)
{
    qspix_err_t ret = QSPIX_SUCCESS;
    qspix_cfg_t p_cfg;

#if QSPIX_CFG_PARAM_CHECKING_ENABLE
    ret = r_qspix_parameter_channel_check(channel);
    if(QSPIX_SUCCESS != ret)
    {
        return ret;
    }

    if(QSPIX_CLOSE == g_qspix_handles[channel].open)
    {
        return QSPIX_ERR_NOT_OPEN;
    }
#endif

    p_cfg = g_qspix_handles[channel].p_cfg;
    p_cfg.protocol = protocol;

    g_qspix_handles[channel].p_cfg = p_cfg;

    /* Set protocol */
    QSPIX.SPMR2.BIT.IOMOD = protocol;
    return ret;
}
/******************************************************************************
End of function r_qspix_set_spi_protocol
******************************************************************************/

/************************************************************************************
* Function Name: r_qspix_bankset
* Description  : Checks parameter.
* Arguments    : channel
*                bank
* Return Value : QSPIX_SUCCESS              Successful operation
*              : QSPIX_ERR_INVALID_ARG      Parameter error
*              : QSPIX_ERR_NOT_OPEN         QSPIX module is not initialized yet
************************************************************************************/
qspix_err_t r_qspix_bankset(uint8_t channel, uint8_t bank)
{
    qspix_err_t ret = QSPIX_SUCCESS;
    
