renesas/rx-driver-package/source/r_qspix_rx/r_qspix_rx_vx.xx/r_qspix_rx/src/targets/rx671/r_qspix_rx671.c
#if QSPIX_CFG_PARAM_CHECKING_ENABLE
    ret = r_qspix_parameter_channel_check(channel);
    if(QSPIX_SUCCESS != ret)
    {
        return ret;
    }

    if(QSPIX_CLOSE == g_qspix_handles[channel].open)
    {
        return QSPIX_ERR_NOT_OPEN;
    }

    /* Check requested bank. */
    if(bank > QSPIX_MAXIMUM_BANK)
    {
        return QSPIX_ERR_INVALID_ARG;
    }
#endif
    /* Select the requested bank. */
    QSPIX.SPUAR = bank<<QSPIX_BANK_MASK;

    return ret;
}
/******************************************************************************
End of function r_qspix_bankset
******************************************************************************/

#if QSPIX_CFG_ERI_INCLUDED
/******************************************************************************
* Function Name:    r_qspix_eri_grp_isr
* Description  :    BSP group interrupt handler for register the error callback function
* Arguments    :    pdata
* Return Value :    N/A
******************************************************************************/
static void r_qspix_eri_grp_isr(void *pdata)
{
    /* Clear error flag */
    QSPIX.SPSR.BIT.ROMAE = 0;

    /* Callback Function */
    g_qspix_handles[QSPIX_CH0].p_cfg.p_callback((void *)NULL);

}
/******************************************************************************
 End of function r_qspix_eri_grp_isr
 *****************************************************************************/
#endif
#endif /* BSP_MCU_RX671 */

/* End of File */

